[
  {
    "id": "5.1",
    "title": "5.1: Tư Tưởng Về Đại Đoàn Kết Toàn Dân Tộc",
    "summary": "Chiến lược tập hợp sức mạnh của TOÀN BỘ dân tộc Việt Nam để thực hiện các nhiệm vụ cách mạng. Sức mạnh này đến từ bên trong.",
    "sections": [
      {
        "id": "5.1.1",
        "title": "5.1.1. Vai trò của đại đoàn kết toàn dân tộc",
        "mainIdea": "Đoàn kết dân tộc là một chiến lược cơ bản, lâu dài và có tính quyết định đến sự thành công của cách mạng. Nó là 'nguồn sức mạnh vô địch'.",
        "message": "Hồ Chí Minh xem đây là vấn đề sống còn. Câu nói nổi tiếng của Người đã tóm gọn vai trò này: 'Đoàn kết, đoàn kết, đại đoàn kết. Thành công, thành công, đại thành công.'"
      },
      {
        "id": "5.1.2",
        "title": "5.1.2. Lực lượng của khối đại đoàn kết",
        "mainIdea": "Khối đại đoàn kết là một tập hợp RỘNG RÃI, bao gồm tất cả mọi người Việt Nam yêu nước, không phân biệt giai cấp, dân tộc, tôn giáo, hay chính kiến.",
        "message": "Nền tảng của khối đoàn kết là liên minh công - nông - trí thức, nhưng phải mở rộng để thu hút cả tư sản dân tộc, địa chủ yêu nước..."
      },
      {
        "id": "5.1.3",
        "title": "5.1.3. Điều kiện để xây dựng khối đại đoàn kết",
        "mainIdea": "Đoàn kết không tự nhiên mà có, nó phải được xây dựng dựa trên những điều kiện cụ thể.",
        "message": "Các điều kiện bao gồm: Lấy lợi ích chung làm điểm quy tụ, kế thừa truyền thống yêu nước, và phải có lòng khoan dung, độ lượng ('cầu đồng dị tồn')."
      },
      {
        "id": "5.1.4",
        "title": "5.1.4. Hình thức tổ chức - Mặt trận dân tộc thống nhất",
        "mainIdea": "Khối đại đoàn kết là khái niệm, còn Mặt trận Dân tộc Thống nhất (ví dụ: Mặt trận Việt Minh) là hình thức tổ chức cụ thể của nó.",
        "message": "Đoàn kết phải có tổ chức thì mới tạo ra sức mạnh. Mặt trận hoạt động dựa trên nguyên tắc hiệp thương dân chủ."
      },
      {
        "id": "5.1.5",
        "title": "5.1.5. Phương thức xây dựng khối đại đoàn kết",
        "mainIdea": "Việc xây dựng khối đoàn kết chủ yếu dựa vào công tác vận động quần chúng.",
        "message": "Đảng Cộng sản lãnh đạo nhưng không phải bằng mệnh lệnh, mà bằng cách tuyên truyền, giáo dục, thuyết phục, và nêu gương."
      }
    ]
  },
  {
    "id": "5.2",
    "title": "5.2: Tư Tưởng Về Đoàn Kết Quốc Tế",
    "summary": "Chiến lược kết hợp sức mạnh dân tộc với sức mạnh của các lực lượng tiến bộ trên thế giới. Sức mạnh này đến từ bên ngoài.",
    "sections": [
      {
        "id": "5.2.1",
        "title": "5.2.1. Sự cần thiết phải đoàn kết quốc tế",
        "mainIdea": "Cách mạng Việt Nam là một bộ phận của cách mạng thế giới. Muốn thành công, phải có sự ủng hộ từ quốc tế.",
        "message": "Lý do: 1) Kết hợp sức mạnh dân tộc với sức mạnh thời đại để chống kẻ thù chung là chủ nghĩa đế quốc. 2) Giúp bạn là tự giúp mình; đây là sự hợp tác bình đẳng, hai bên cùng có lợi."
      }
    ]
  }
]